Revit 2027 API
SymbolicCurveArray.Append Method
Add the model curve to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	SymbolicCurve item
)
Public Overridable Sub Append (
	item As SymbolicCurve
)
public:
virtual void Append(
	SymbolicCurve^ item
)
abstract Append :
        item : SymbolicCurve -> unit
override Append :
        item : SymbolicCurve -> unit
Parameters
item SymbolicCurve
The model curve to be added.
See Also
Reference
SymbolicCurveArray Class
Autodesk.Revit.DB Namespace